[
  {
    "id": "2006-start",
    "year": "2006",
    "title": "Начало пути в КРОК",
    "status": "ready",
    "featured": true,
    "link": "year.html?y=2006-start",
    "inlineImage": {
      "src": "https://drive.google.com/thumbnail?id=1Au9K36sW6pBGitq4_yOXmrK0vPURqW8l&sz=w1200",
      "full": "https://drive.google.com/uc?export=download&id=1Au9K36sW6pBGitq4_yOXmrK0vPURqW8l",
      "alt": "Старт Любы в КРОК"
    },
    "body": "2006 год — точка входа в КРОК.\n Люба пришла в компанию на позицию инженера-разработчика бизнес-приложений на проект Navision. В день собеседования было очень холодно — около −20, офис искался долго, но встреча прошла хорошо и запомнилась надолго.\nNavision был новой системой, поэтому первые месяцы ушли на погружение: изучение платформы, процессов и команды. Рост внутри компании произошёл достаточно быстро и естественно — во многом благодаря прошлому опыту и образованию. По специальности Люба — экономист в информационных системах, и сочетание экономики, ИТ и программирования помогло глубоко понимать бизнес-задачи, а не только код."
  },
  {
    "id": "2007-2008-growth",
    "year": "2007–2008",
    "title": "Погружение и рост",
    "status": "ready",
    "link": "year.html?y=2007-2008-growth",
    "body": "В этот период формируется профессиональная база.\n\nЛюба активно развивается как разработчик, глубоко вникая в предметную область.\n\nИменно здесь закладывается ключевая особенность её подхода — интерес не только к технике, но и к тому, как бизнес работает целиком.\n\nПоявляется то, что останется с ней на годы вперёд: внимательность к деталям, умение разбираться в сложных взаимосвязях, командность.\n\nЛетнее празднование дня рождения КРОК в эти годы было особенно весёлым — много улыбок, тепла и классных моментов вместе.",
    "images": [
      {
        "src": "https://drive.google.com/thumbnail?id=1BLWL950tdB4YDB0uE4wi2-VF428z7X-V&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=1BLWL950tdB4YDB0uE4wi2-VF428z7X-V",
        "alt": "Летний праздник КРОК — команда за столом на природе"
      },
      {
        "src": "https://drive.google.com/thumbnail?id=1AhT6Witp_u86-SKKObnaGEv8PaRNd1yo&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=1AhT6Witp_u86-SKKObnaGEv8PaRNd1yo",
        "alt": "Летний праздник КРОК — портрет у воды"
      },
      {
        "src": "https://drive.google.com/thumbnail?id=1hIRpiJExETgNGiKbaZykCyDwVeGKyuE2&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=1hIRpiJExETgNGiKbaZykCyDwVeGKyuE2",
        "alt": "Летний праздник КРОК — отдых в парке с угощениями"
      },
      {
        "src": "https://drive.google.com/thumbnail?id=15-ggaE94zKIN6N9k2xB5O8Hy52dVzEmt&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=15-ggaE94zKIN6N9k2xB5O8Hy52dVzEmt",
        "alt": "Летний праздник КРОК — сцена с баннером"
      },
      {
        "src": "https://drive.google.com/thumbnail?id=1VGaOaxDL6R7Sh3Om7Lj89NKspXSaSDqG&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=1VGaOaxDL6R7Sh3Om7Lj89NKspXSaSDqG",
        "alt": "Летний праздник КРОК — друзья под зелёной аркой"
      },
      {
        "src": "https://drive.google.com/thumbnail?id=1qP2HlvGMNKR-hbDdAfGe1fWWKr7a8Y6R&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=1qP2HlvGMNKR-hbDdAfGe1fWWKr7a8Y6R",
        "alt": "Летний праздник КРОК — пикник и кальян"
      },
      {
        "src": "https://drive.google.com/thumbnail?id=1m6tpRtXVeN9FhHdnvUGWTK9fVaGhHSn9&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=1m6tpRtXVeN9FhHdnvUGWTK9fVaGhHSn9",
        "alt": "Летний праздник КРОК — улыбки у белого фона"
      },
      {
        "src": "https://drive.google.com/thumbnail?id=1wYSmJh8wyZuNdc6y04hkxQnIHRNpxrBn&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=1wYSmJh8wyZuNdc6y04hkxQnIHRNpxrBn",
        "alt": "Летний праздник КРОК — солнечный портрет"
      },
      {
        "src": "https://drive.google.com/thumbnail?id=15JnzWDpCzae2V7qk9V2VaMDUyf6VGhy6&sz=w800",
        "full": "https://drive.google.com/uc?export=download&id=15JnzWDpCzae2V7qk9V2VaMDUyf6VGhy6",
        "alt": "Летний праздник КРОК — дружеский кадр крупным планом"
      }
    ]
  },
  {
    "id": "2008-2010-bi",
    "year": "2008–2010",
    "title": "Переход в BI и начало большого проекта",
    "status": "ready",
    "link": "year.html?y=2008-2010-bi",
    "body": "В КРОК появляется потребность в сводной управленческой отчётности для топ-менеджмента.\n\nТак рождается проект Корпоративная отчётность BI, куда Любу приглашают одной из первых.\n\nНа старте команда BI — всего три человека:\n\nдва разработчика и менеджер.\n\nПриходится совмещать роли аналитиков, тестировщиков и разработчиков.\n\nИменно тогда:\n\nзакладывается архитектура BI,\n\nформируются первые ночные обновления,\n\nначинается интеграция данных из ключевых систем компании.\n\nС этого момента BI становится основным проектом Любы — и остаётся им на многие годы."
  },
  {
    "id": "2009-2015-bi-growth",
    "year": "2009–2015",
    "title": "BI растёт вместе с командой",
    "status": "ready",
    "link": "year.html?y=2009-2015-bi-growth",
    "body": "Люба продолжает работать на проекте, совмещая профессиональную жизнь с периодами декрета и постепенно выстраивая удалённый формат работы, еще не зная, что задает тренд на будущие года для всего мира IT.\n\nЧасть задач решается ночью, отчётность обновляется вне рабочего дня, а работа не останавливается ни из-за временных ограничений, ни из-за обстоятельств.\n\nЭто требует высокой ответственности и доверия — и то, и другое становится неотъемлемой частью проекта.\n\nПараллельно BI активно растёт как система.\n\nПостепенно увеличивается количество источников данных: HRMS, Clarity, 1C и другие внутренние системы.\n\nДанные начинают объединяться в единое хранилище, формируются кубы и дашборды, которыми пользуются подразделения по всей компании.\n\nНа стороне отчётности появляются сложные алгоритмы проектного учёта и обработки данных, отражающие реальную логику бизнеса.\n\nЭтот период — про устойчивость.\n\nПро способность развивать критически важный проект, даже когда условия далеки от идеальных."
  },
  {
    "id": "2016-replatform",
    "year": "2016",
    "title": "Первое большое перевнедрение",
    "status": "ready",
    "link": "year.html?y=2016-replatform",
    "body": "2016 год — важная техническая веха.\n\nПроисходит первое крупное перевнедрение хранилища данных.\n\nЭто момент, когда накопленный опыт начинает работать на масштаб:\n\nархитектурные решения становятся сложнее,\n\nответственность выше,\n\nпоявляются новые технологии,\n\nпроект BI окончательно закрепляется как критически важный для бизнеса."
  },
  {
    "id": "2017-2018-role",
    "year": "2017–2018",
    "title": "Возвращение в офис и новая роль",
    "status": "ready",
    "link": "year.html?y=2017-2018-role",
    "body": "Начиная с 2017 года Люба постепенно возвращается в офис, сохраняя при этом гибкий формат работы.\n\nВ этот период меняется фокус работы.\n\nПомимо разработки, всё больше внимания уделяется людям и передаче знаний.\n\nЛюба участвует в первой IT-школе, делится опытом, помогает новичкам погрузиться в проект и начинает получать первые отзывы от учеников — в том числе от Кирилла, которые становятся важным подтверждением ценности этой работы.\n\nПараллельно BI продолжает усложняться как система.\n\nПоявляются задачи, связанные с Data Mining-моделями и прогнозированием трудозатрат, требующие глубокого понимания данных и бизнес-процессов.\n\nВ этот момент роль Любы на проекте окончательно трансформируется — она берёт на себя ответственность ведущего разработчика BI."
  },
  {
    "id": "2019-maturity",
    "year": "2019",
    "title": "Зрелость проекта",
    "status": "ready",
    "link": "year.html?y=2019-maturity",
    "body": "BI — зрелый продукт, которым пользуются практически все подразделения КРОК.\n\nКоманда выросла, процессы устоялись, а роль Любы — это уже не только разработка, но и экспертиза, поддержка, помощь коллегам."
  },
  {
    "id": "2020-remote",
    "year": "2020",
    "title": "Ковид и резкий переход всей компании на удалёнку",
    "status": "ready",
    "link": "year.html?y=2020-remote",
    "body": "2020 год стал временем резких перемен — и для компании в целом, и лично для Любы.\n\nПереход на удалённый формат произошёл внезапно и сразу для всех.\n\nНесмотря на внешнюю нестабильность, работа проекта не остановилась.\n\nПоявляется новый менеджер проекта — Илья Саламатов, которому нужно быстро погрузиться в сложный и уже зрелый BI-ландшафт.\n\nЛюба активно помогает ему освоиться, стараясь использовать этот период неопределённости как возможность для улучшения проекта.\n\nВ это время меняется и ресурсный менеджер Любы — им становится Виталий Захаров.\n\nДополнительной нагрузкой становится уход Ильи Захарова с проекта.\n\nЧасть экспертизы и ответственности ложится на Любу, и она глубоко погружается в новые для себя направления — Spark и BRMS, расширяя технический стек и закрывая критически важные зоны.\n\nЭтот год требует максимальной собранности и устойчивости.\n\nBI работает, данные обновляются, пользователи получают отчётность вовремя.\n\nПроект выдерживает нагрузку — во многом благодаря опыту, гибкости и готовности брать на себя ответственность в моменты, когда это особенно важно."
  },
  {
    "id": "2021-2023-architecture",
    "year": "2021–2023",
    "title": "Масштабные перевнедрения и архитектура",
    "status": "in_progress",
    "link": "year.html?y=2021-2023-architecture",
    "body": "Период с 2021 по 2023 год становится временем крупных системных изменений.\n\nBI и связанные с ним процессы проходят через масштабные перевнедрения: обновляется ERP, перестраивается BI, внедряется ЗУПкорп.\n\nЭти изменения затрагивают не только технологии, но и привычные способы работы, требуя пересмотра архитектурных решений и внимательной настройки всех связей между системами.\n\nПараллельно растёт команда разработки.\n\nК проекту присоединяется стажёр Юля, и вместе с новыми людьми появляется дополнительная ответственность — не только за результат, но и за качество передачи знаний и погружение в сложную предметную область.\n\nВ этот же период Люба подключается к проекту «Архитектура».\n\nЭто расширяет зону её влияния и позволяет участвовать в более стратегических обсуждениях: как должны выглядеть системы в долгосрочной перспективе, какие решения обеспечат устойчивость и масштабируемость, а какие создадут риски в будущем.\n\nНесмотря на постоянные изменения, проект постепенно стабилизируется.\n\nBI становится сложнее по устройству, но при этом более надёжным и устойчивым — системой, которая выдерживает рост бизнеса и остаётся понятной тем, кто с ней работает каждый день."
  },
  {
    "id": "2024-finance-model",
    "year": "2024",
    "title": "Финансовая модель",
    "status": "in_progress",
    "link": "year.html?y=2024-finance-model",
    "body": "Начинается важный этап, связанный с внедрением новой финансовой модели.\n\nЭти изменения требуют аккуратной настройки логики расчётов и внимательного отношения к деталям, чтобы BI продолжал корректно отражать реальную картину бизнеса.\n\nУ Любы меняется ресурсный менеджер — Юра Шашкин.\n\nКоманда разработки продолжает расти — к проекту присоединяется стажер Саша.\n\nНовые люди органично встраиваются в уже сложившиеся процессы, усиливая команду и расширяя её возможности.\n\nКоманда разработки сильнее разрастается под управлением Любы.\n\nПомимо рабочих задач, в этом году особенно ощущается командность.\n\nПоявляются совместные активности и тимбилдинги.\n\nBI остаётся сложным проектом, но за ним стоит сильная, сплочённая команда, на которую можно опереться."
  },
  {
    "id": "2025-new-people",
    "year": "2025",
    "title": "Новые люди и новые алгоритмы",
    "status": "in_progress",
    "link": "year.html?y=2025-new-people",
    "body": "Ресурсным менеджером проекта становится Женя Тарабухина, и вместе с этим продолжается планомерное развитие BI — уже не в формате резких изменений, а через точечные, но важные улучшения.\n\nВ этом году остаётся место и для живых, человеческих моментов.\n\nЛетний корпоратив запоминается тёплой атмосферой и фотографией с Любой.\n\nПоявляется и отпуск с морем, в котором не поплавать.\n\nПри этом техническая часть проекта не сбавляет темп.\n\nПроисходит перевнедрение обратного расчёта — сложной логики, требующей глубокого понимания бизнес-процессов и данных.\n\nЭто становится важным шагом для BI, усиливающим точность расчётов."
  },
  {
    "id": "2026-summary",
    "year": "2026",
    "title": "Итог, влияние и продолжение",
    "status": "upcoming",
    "link": "year.html?y=2026-summary",
    "body": "К 2026 году за плечами — большой и насыщенный путь.\n\nТысячи задач, решённых в разное время и в разных условиях: 2089 зафиксированных в JIRA и ещё неизвестное количество в трекере.\n\n7 ресурсных менеджеров, 2 департамента, 2 декрета и более 12 лет удалённой работы — задолго до того, как это стало модно.\n\nНо 2026 год — не только про цифры и факты.\n\nЭто момент, в котором особенно ясно видно, как развитие Любы внутри компании шло параллельно развитию проекта BI.\n\nПо этапам её профессионального роста можно проследить, как усложнялась архитектура, росла команда и менялась роль BI внутри КРОК.\n\nСегодня этот проект невозможно представить без Любы — так же, как и без решений, подходов и экспертизы, которые формировались год за годом.\n\nК этому моменту BI — одна из ключевых систем компании и команда из 17 человек, за которой стоит многолетний опыт работы.\n\nСпасибо, Люба, за 20 лет в КРОК.\n\nЗа вклад, который стал частью проекта.\n\nИ за путь, который продолжается."
  }
]
